In [2]:
import pandas as pd
import pyodbc

def mssql_connection(password: str, username: str, default_db: str = "master"):
                     server = "localhost"
                     
                     cnxn = pyodbc.connect(
                         "DRIVER={ODBC Driver 17 for SQL Server};SERVER="
                         + server
                         + ";DATABASE="
                         + default_db
                         + ";UID="
                         + username
                         + ";PWD="
                         +password
                     )
                     return cnxn

In [3]:
conn = mssql_connection(password= "CCny23912093" , username= "SarahMcKoy93" , default_db="summer_2022")

In [4]:
laguardia_revenue_2017_df = pd.read_sql("SELECT total_amount FROM [2017_taxi_trips] LEFT JOIN taxi_zones ON [2017_taxi_trips].DOLocationID = taxi_zones.LocationID WHERE Zone = 'LaGuardia Airport'", conn)

In [5]:
laguardia_revenue_2017_df

       total_amount
0               5.3
1              13.8
2              13.8
3              13.8
4              13.8
...             ...
133250         17.3
133251         14.8
133252         16.8
133253         14.3
133254         17.8

[133255 rows x 1 columns]

In [6]:
print(laguardia_revenue_2017_df.dtypes)

total_amount    object
dtype: object

In [7]:
laguardia_revenue_2017_df['total_amount'] = pd.to_numeric(laguardia_revenue_2017_df['total_amount'])

In [8]:
print(laguardia_revenue_2017_df.dtypes)

total_amount    float64
dtype: object

In [9]:
laguardia_revenue_2017_df.sum()

total_amount    3486432.37
dtype: float64

In [10]:
queens_dropoffs_2017_df = pd.read_sql("SELECT total_amount FROM [2017_taxi_trips] LEFT JOIN taxi_zones ON [2017_taxi_trips].DOLocationID = taxi_zones.LocationID WHERE Borough = 'Queens'", conn)

In [11]:
queens_dropoffs_2017_df['total_amount'] = pd.to_numeric(queens_dropoffs_2017_df['total_amount'])

In [12]:
queens_dropoffs_2017_df.sum()

total_amount    46291046.52
dtype: float64